Public Member Functions | Friends | List of all members
ACAPI::MEP::RigidSegmentUIManager Class Referencefinal
MEP Element Manager
The RigidSegmentUIManager contains UI-related services for a RigidSegment. More...
#include <MEPRigidSegmentUIManager.hpp>
 Inheritance diagram for ACAPI::MEP::RigidSegmentUIManager:
 Public Member Functions
Result< RigidSegmentDefault >  | CreateRigidSegmentDefaultFromToolUIData (const TBUI::IAPIToolUIData &toolUIData)
Creates a RigidSegmentDefault from a toolUIData.
Result< void >  | ApplyRigidSegmentDefaultToToolUIData (TBUI::IAPIToolUIData &toolUIData, const RigidSegmentDefault &rigidSegmentDefault)
Changes the default elem in the given toolUIData.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
Result< RigidSegmentUIManager >  | CreateRigidSegmentUIManager ()
Creates a RigidSegmentUIManager.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The RigidSegmentUIManager contains UI-related services for a RigidSegment.
Since
Archicad 28
Member Function Documentation
◆ ApplyRigidSegmentDefaultToToolUIData()
 Result< void > ACAPI::MEP::RigidSegmentUIManager::ApplyRigidSegmentDefaultToToolUIData  |  ( |  TBUI::IAPIToolUIData & |  toolUIData,
|  const RigidSegmentDefault & |  rigidSegmentDefault )
Changes the default elem in the given toolUIData.
Parameters
toolUIData | The data in which the default elem will be changed
rigidSegmentDefault | The default to be set
Returns
Returns error if the RigidSegmentDefault is not the same type as the Default in IAPIToolUIData, or if they mismatch in their MEP Domain, otherwise nothing.
◆ CreateRigidSegmentDefaultFromToolUIData()
 Result< RigidSegmentDefault > ACAPI::MEP::RigidSegmentUIManager::CreateRigidSegmentDefaultFromToolUIData  |  ( |  const TBUI::IAPIToolUIData & |  toolUIData | )
Creates a RigidSegmentDefault from a toolUIData.
Parameters
toolUIData | The data which contains the temporary state of the RigidSegment in the scope of a Settings Dialog.
Returns
Returns error if the given Default from the IAPIToolUIData is not an RigidSegmentDefault, otherwise returns the RigidSegmentDefault created from it.
Friends And Related Symbol Documentation
◆ CreateRigidSegmentUIManager
 Result< RigidSegmentUIManager > CreateRigidSegmentUIManager  |  ( |   | )
friend
Creates a RigidSegmentUIManager.
Returns
If able, creates a new manager for RigidSegment, otherwise Error.